from google.cloud import translate_v2 as translate
import six
import os
from config import *
os.environ[TRANSLATEKEYTYPE] = TRANSLATEKEYPATH
def get_translation(text,Tcode):
    """Detects the text's language."""
    
    if isinstance(text, six.binary_type):
        text = text.decode("utf-8")
    translate_client = translate.Client()
    result = translate_client.translate(text, target_language=Tcode)
    return result["translatedText"].replace('&#39;',"'")

text="""Ողջույն սիրելի կոլեգաներ ես Աննա Հազոյանն եմ Երևանի պետական բժշկական համալսարանի
գաստրոէնտրոլոգիայի և պատալոգիայի ամնիոնի դասախոս, Միքաելյան համալսարանական հիվանդանոցի համանուն
բաժանմունքի բժիշկ գաստրոէնտերոլոգ, լյարդաբան։ Այսօր մենք կխոսենք լյադրի ցիրոզի մասին։ Լյարդի ցիրոզը դա
կլինիկո-պաթոլոգիական ախտահարում է, որը բնութագրվում է լյարդում ֆիբրոզ ռենգեներացիոն հանգույցների
ձևավորմամբ, որոնք բերում են լյարդի նորմալ արխիտեկտուրայի խանգարման։ Ցիրոզը համարվում է ֆիբրոգենեզի
վերջնական տերմինալ փուլը։ Եվ ֆիբրոզը, և ցիրոզը զարգանում են ի պատասխան լյարդի խռոնիկ վնասման։
Էպիդեմոլոգիայի մասին եթե խոսենք Եվրոպայում մահացությունը համարվում է տարեկան հարյուր յոթցուն հազար
դեպք, ամերիկայի միացյալ նահանգներում ավելի քիչ է երեսունհինգ հազար մարդ տարեկան մահանում է լյադի
ցիրոզից և նրանից առաջացած բարդություններից։ Ամենահաճախ հանդիպող պատճառներն են ալկոհոլի
չարաշահումը, խռոնիկ վիրուսային հեպատիտները, B և C և լյարդի ոչ ալկոհոլային ճարպային գոյացությունը կամ
ինչպես այժմ ընդունված է ասել լյարդի մետաբոլիկ ասոցացված հիվանդությունը։
Էթիոլոգիան առաջին ամենահաճախ պատճառն ինչպես ասեցինք դա վիռուսային հեպատիտներն են, հեպատիտ B, C, D
լյարդի ալկոհոլային հիվանդությունը, ոչ ալկոհոլային ճարպային հիվանդությունը, լյարդի մոտաբոլիկ
հիվանդություններըորոնցից են՝
ժառանգական հեմաքրոմատոզ, Վիլսոն- Կոնավալովի հիվանդությունը, ալֆա մեկ անտիտրիպիսոն
անբավարաությունը, կիստոզ-ֆիբրոզ հիվանդությունը, ամինաթթվային խանգարումներ թիրոզինեմիան, ածխաջրային
խանգարումները ՝ գալակտոզեմիան, ֆրուտոզային անտանելիությունը, լիպիդային խանգարումները պորֆերիան
Դեղ ինդուկցված լյարդի վնասումը ևս կարող է ցիրոզի պատճառ դառնալ։ Լյարդի խռոնիկ խոլեստատիկ
հիվանդությունները՝ առաջնային բիլյար ցիրոզ, առաջնային սկլերոզացնող խոլանգիտ, ինչպես նաև իմունոգլուբոլին
ջի չորս ասոցացված խոլանգիոպաթիա
խռոնիկ բիլիար հիվանդություններ՝ ռեցիդիվող բակտերիալ խոլանգիտ, լեղածորային ստենոզ, լեղածորանի
ատրեզիա, բնածին բիլիար կիստաներ
կարդիովասկուլյար խանգարումներ՝ Բադ կիարի հիվանդություն, վենոկլյուզիվ հիվանդությունը, կանգային սրտային
անբավարարություն, կամ կոնստրուկտիվ պերիկարդրիտ, օսլեր վեբերի հիվանդություն, և այլ պատճառներ ևս կարող
են լինել՝ իդիոպարտիկ պորտալ հիպերտեզիան կարող է ի վերջո բերել լյարդի ցերոզիառաջացման, լյարդի
պոլիկիստոզ հիվանդությունը, սարկոիդոզը, լյարդի ամոլիոդոզը կուտակային այլ հիվադնություններ ևս և խռոնիկ
ինֆեկցիաներ բրուցելոզ, սիֆիլիս, շիստոսոմատոզ, էխինակոկոզ։
Կրիպտոգեն ցիրոզ տերմինը տերմին ևս գոյություն ունի։ Կրող ենք օրինակ նշել լյարդի հնդկական ցիրոզը, որը
հաճախ հանդիպում է հնդկաստանում մանկահասակ երեխաների մոտ, որի վերջնական պատճառը հայտնաբրված չէ,
այն կարելի է դասել կրիպտոգեն ցիրոզների խմբում, որը պայմանավորված է ըստ երևույթին հետազոտությունները
ցույց են տալիս, որ ավելի հաճախ հանդիպում է այն երեխաների շրջանում, ովքեր սնվել են արհեստական
ճանապարհով, այսինքն մայրական կրծքի կաթ կամ չեն կերել, կամ քիչ են կերել և կերել են հավելյալ սնունդ։
Լյարդի ցիրոզի առաջացման գործում տարբեր գործոններ ունեն մասնակցություն դրանցից է՝ տարիքը, սեռը իմուն
համակարգի կարգավիճակը, տարբեր վնասակար սովորությունների առկայությունը։
"""
text2="""
Ավելի արագ կանանց մոտ ալկոհոլի կիրառումը բերում է լյարդի ցիրոզի առաջացման դրա պատճառները տարբեր են,
որոնցից որոշների կանդրադառնանք։ Եթե կա զուգահեռ նաև մարդու ձեռքբերովի իմունային անբավարության վիրուս
իմունոսուպրեսիվ դեղորայքի օգտագործում պացիենտը օրինակ որևէ օրգանի տրանսպարտացիայից հետո և այլն։
Լյարդի նոռմալ արխիտեկտուրան եթե հիշենք, ապա լյարդի ֆունկցիոնալ միավորը վեցանկյունն է կամ հեքսագոնը,
որի կենտրոնում գտնվում է վենացենտրալիսը կենտրոնական երակը։ Բերիֆերիկ հատվածում վեցանկյան վեց
գագաթներում գտնվում է պորտալ տրիադան, որը ներառում է լյարդային զարկերակը , երակը և լենուղին։ Լյարդային
զարկերակը և երակը տերմինալ ճյուղերով միաձուլվում են ձևավորելով սինուսիոդը։ Սինուսոիդը ինչպես գիտենք դա
լյարդի սպեցիֆիկ մազանոթն է որը չունի բազալ թաղանթ և որի վրա կան ֆենեստրաներ, անցքեր այդ
ֆենեստրաների միջոցով արյունը հոսում է սինուսոիդից դեպի հեպատոցիտներ պերիսինուսոիդալ տարածությունով և
այսպես իրականանում են լյարդի բոլոր ֆունկցիաները։ Եվ հիշենք այն բջիջները, որոնք կարևոր դեր կունենան
լյարդի ցիրոզի ձևավորման պատոգենեզում դրանցից թերևս ամենակարևորը դիսեյի կամ պերիսինուսոիդալ
տարածությունում գտնվող այս աստղաձև բջիջներն են, որոնց նաև անվանում են ստելադ բջիջներ, իտոյի բջիջներ։
Աստղաձև բջջի մասին խոսենք, այն պերիսինուսոիդալ տարածությունում է տեղակայված, մեզանգյալ ծագման բջիջ է
հիմնականում ծառայում է որպես ռետինոլի պահեստ, արյան հոսքի կարգավորիչ է ֆիզիոլոգիական դերերից է նաև
կծկվելով նեղացնում է սինուսոիդի նեղանցքը և նորմայում գտնվում է հանգիստ ոչ ակտիվ վիճակում։
Երբ ակտիվանում է աստղաձև ստելադ բջիջը այն տրանսֆորմացվում է միոֆիբրոբլաստանման բջջի և մի շարք
պրոցեսներ է թողարկում, դրանցից առաջինը պրոլիֆերացիան է այնուհետև էնդոթելին մեկին սինթեզը երբ
շատանում է տեղային ֆիբրոզ փոփոխմանը զուգահեռ նաև էնդոթելին մեկի կուտակումում ենք ունենում բերում է
կծկողականության մեծացման և սինուսոիդ լուսանցքի նեղացման ։ Ֆիբրոգենեզի խթանում մյուսը մատրիքսի
դեգրատացիա և ինտեստրիկցալ տիպի մատրիքսի կուտակում ։ Ռետինոլի կորուստ քանի որ այն համարվում է
ռետինքլի պահեստ, քեմոտաքսիսի խթանում, պրոբորբոքային ցիտոկինների քանակի ավելացում և բորբոքայի
քեմոատրակտանտների կուտակում։ Այսինքն այն ունի շատ կարևոր մեխանիզմներ լյարդի բորբոքման առաջացման
մեջ և որ ամենակարևորն է արտաբջջային տարածությունում ինտեստրիկցալ մատրիքսի կուտակումը։ Եվ հիշենք
լյարդի ֆունկցիոնալ միավորներից ացինուսը։ Ացինուսի կենտրոնում գտնվում է առաջին զոնան որը կոչվում է նաև
պերիպորտալ զոնա, իսկ ացինուսի պերիֆերիկ հատվածում վենացենտրալիսն է կամ վենիցենտրալ զոնան։ Այս
դասակարգումը շատ կարևոր է նաև ֆունկցիոնալ տեսանկյունից։ Առաջին զոնայում այսինքն պերիպերտալ զոնայում
գտնվող հեպատուցիտները, որոնք ստանում են ավելի լավ արյունամատակարարում քան օրինակ երրորդ զոնայում
գտնվող հեպատուցիտները քանի որ ակնհայտ է որ առաջին զոնայում գտնվող հեպատուցիտները մոտ են սնուցող
հիմնական անոթներին այսինքն լյարդային զարկերակից և դներակից եկած սինուսոիտալ պարունակության արյանը
և նրանց արյունամատակարարումը ավելի լավ է դա բերել է նրան որ առաջին զոնայում հեպատուցիտները
ֆունկցիոնալ առումով ավելի ակտիվ են քան երրորդ զոնայում գտնվող հոպատուցիտները; և լյարդի տարբեր
հիվանդությունների ժամանակ այս մեխանիզմն ունի կարևոր դեր և տարբեր հիվանդությունների ժամանակ տարբեր
զոնաներ են ախտահարվում։ Օրինակ վիրուսային հեպատիտների ժամանակ վիրային հեպատիտ B, C ի վիրուսային
խռոնիկ հեպատիտների կամ լյարդի ոչ ալկոհոլային ճարպային հիվանդության ժամանակ հիմնականում բորբոքային
պրոցոսը տեղակայվում է առաջին զոնայում։ Իսկ երրորդ զոնան հիմնականում քանի որ այստեղ ունենք ակտիվ
ցիտոխրոն պ 450 համակարգ,որը պատասխանատում է դետոկսիկացիայի համար երրորդ զոնայի ախտահարում
հաճախ ունենում ենք օրինակ լյարդի ալկոհոլային հիվանդության ժամանակ կամ լյարդի տոքսիկ ախտահարումների

դեպքում։ Առաջին նկարում ինչպես տեսնոմ եք նոռմալ լյարդն է ցուցադրված, որտեղ աստղաձև բջիջները գտնվում
են հանգիստ վիճակում ոչ ակտիվ, նոռմալ սինուսոիդալ լուսանցք որտեղ գտնվում են կուֆելյան բջիջները, որոնք
պատասխանատու են ինտենսիվ ֆագոցիտոզի իրականացման համար։ Հեպատոցիտները պատված են
տավիկապատներով։ Ինչ է տեղի ունենում երբ զարգանում է լյարդի ցիրոզ այս դեպքում արդեն ուենում ենք
պերիսինուսոիդալ տարածությունում աստղաձև բջիջների պրոլիֆերացիա նրանց քանակն ավելանում է ակտիվանում
են և արդեն տեսնում ենք ինտեստրիցալ արտաբջջային մատրիքսի կուտակում, որը ֆիբրոզի հիմքն է հանդիսանում։
Հեպաուցիտները կորցրել են իրենց թավիկները և ունենում ենք սինուսոիդի լուսանցքի նեղացում և ակտիվացած
կուպֆելյան բջիջներ որոնք դարձյալ պատասխանատու են այդ բորբոքային կասկադի թողարկաման համար։
Արդյունքում մակրոսկոպիկ լյարդը փոփոխվում է և առաջացնում է այսպես հանգուցավոր պատկեր։
Հեպատոցիտների պրոֆիլերացիան բարձր ռեգեներացիոն հատկությամբ օժտված օրգան է ։ Փերբազատված
միտոգոները ազդելով հեպատոցիտների վրա խթանում են դրանքց ռեգեներացիան ձևավորվում են ֆռեգեներացիոն
հանգույցներ որոնց արդյունքում խաղտվում է լյարդի նոռմալ արխիտեկտուրան, ձևավորվում են կեղծ բլթակների
որոնցում հեպատոցիտները չունեն ճառագայթային ձևավորվածություն, իսկ պորտալ տրիադան և վենացենտրալիսը
բացակայում են ։"""
text3="""
Լյարդի ցիրոզի պատճառների մեկնաբանումը։
Խռոնիկ հեպատիտ բ վարակը համարվում է լյարդի ցրրոզի հիմնական պատճառներից մեկն ամբողջ աշխարհում։ Այն
դասվում է հեպատնավիրիդե ընտանիքին ունի 8 գենոտիվ։ Գենոֆոնդը իրենից ներկայացնում է երկշղթա դնթ որն
ունի դրական և բացասական շղթաներ ընդ որում դրական շղթան ավելի կարճ է քան բացասական շղթան և ունի դնթ
պոլիմերազը որը պատասխանատու է դնթի ամբողջականության վերականգնման համար ։ Ունի բազմաթիվ
անտիգեններ S անտիգենները որոնք լիպոպրոտեդային պատյանում ենք, որոնք տարբեր չափերի են լինում մեծ փոքր
և միջին այնուհետև վիրուսի գենոմը և պոլիմերազը անշրջափակող սիանտիգեները որոնք ևս ունեն շատ կարևոր դեր
վիրուսի կենսագործունեության համաւր և E անտգեները որոնք գտնվում են կորիզային անտիգեների, C անտիգեների
S անտիգեների միջև, E անտիգեները ըստ երևույթի պատասխատու են վիրուսի ռեպլիկացիայի համար քանի որ
ռեպլիկացիյի փուլում E անտիգեները մակարդակը բվարձրանում է սակայն կան նաև մուտանտ շտամմեր, որոնց
դեպքում ռպլիկացիան չի ուղեկցվում շրջանառվող արյան մեջ E անտիգենի մակարդակով ։ Այստեղից տեսվում ենք
հեպատիտ B ի տարածվածությունն ամբողջ աշխարհում այս քարտեզը կազմվել է 2005 թվականին ավելի
մանրամասն այս մասին կարող եք դիտել հեպատիտ B ի վերաբերյալ դասախոսության մեջ այստեղ ուղղակի ասեմ որ
աշխարհագրական ռեգիոնները տարբեր են և հեպատիտ B ի տարավծածությունը տարբեր երկրներում տարբեր է
տեսնում ենք որ մուգ գունավորմամբ այսինքն ութ տոկոսից ավել տարածվածության ռեգիոններ կան դա
հիմանականում ասիական երկրներն են որտեղ նաև շատ տարածված են հեպատիտ B ով պայմանավորված տարբեր
բարդությունների առկայությունը, ցիրոզի և դրա բարդությունների ինչպես նաև հեպատոցելուլյար քաղցկեղի։
Փոխանցման ուղիները վիռուսի հիմնական ճանապարհը արյունային ճանապարհն է, երակայինն թմրանյութերի
կիրառման , փոխանցվում է նաև սեռական ճանապարհով վեռտիկալ ճանապարհով մորից պտղին կենցաղային իրերը
կիսելու միջոցով և այլն ;
Եվ պետք է նշել, որ վիրուսի ամենաբարձր տիտերը առկա է արյան մեջ և օրգանիզմի մնցած կենսաբանական
հեղուկներում արդեն համեմատաբար ավելի ցածր է վիուսի տիտերը։ Լյարդի վնասման մեխանիզմները և ի վերջո

լյարդիցեռոզի ձևավոևման մեխաիզմը հեպատիտ Բ ի դեպքում բազմագործունային է սկսվում է բնածին
իմունհամակարգի ակտիվացումից նատուրալ քիդերների ակտիվացմամբ որոնք ի վերջո բերում են հակավիրուսային
ցիտոկիների քանակի շատացման իսկ դրանք խթանում են արդեն հումորալ իմունպատասխանը և եթե սինթեզվումեն
բավարար քանակությամբ նոռմալ հակապատճային հակամարմիններ սա բերում է վիռուսի լրիվ եմինիլացիայի, իւսկ
եթե այդ պրոցեսը տեղի չի ունենում մարդն ունի իմունային համակարգի անբավարարություն օրինակ այդ դեպքում
կունենաք հիվանդության խռոնիզացիա, և վերջին օղակում բջջային իմուն համակարգն է պատասխանատու որը
նմանեցվումէ երկբերան թրի որին պետք է ասել, որ այս մեխանիզմը այս վերջին կետը CD4 ևCD8 բջիջներռվ
միջնորդավորված բանծւն իմունհամակարգը պատասխանատում է և հեպատիտ Բ ի և հեպատիտ Ց ի դեպքում լյարդի
խռոնիկ ախտահարման ընդհուպ մինչև ցիռոզի առաջացման համար։ Մասնավորապես եթե այս ռեակցիան այս
բջջային ռեակցիան տեղի է ունենում ադեկվատ և բավականին ինտենսիվ սա բերում է վիռուսի էմինիլացիայի իսկ
եթե այն թույլ է ապա բերում է հեպատոցիոտների խռոնիկ վնասման ի վերջո լյարդի ցիրոզի առաջացմամբ։
Խռոնիկ հեպատիտ Ց վարակը աշխարհում մոտավորապես 71 միլիոն մարդ ունի խռոնիկ հեպատիտ Ց տարեկան
մոտավորապես 399,000 մարդ մահանում է լյարդի ցեռոզից և նրանից առաջացած բարդություններից որոնք
առաջացել են հեպատիտ Ց վիռուսով պայմանավորված։
Փոխանցման ուղիները ․ հիմնական փոխանցման ուղին արյունայյինն է ըևնդ որում արյան տրանսֆուզիայի միջոցով
փոխանցում է մինչև 1990-ականներն էր շատ հայտնի շատ էր այդ ճանապարհով այդ վիռուսը փոխանցվում ,
այնուհետև վիռուսի հայտնաբերմանը զուգահեռ արդեն բոլոր դոնորները հետազոտվում էին և հեպատիտ Բի և
հեպատիտ Ց ի և այլ վիռուսներիկապակցությամբ և այս ուղին այժմ այդքան էլ ակտուալ չէ։ Հիմնական փոխանցման
տարբերակը փոխանցման ուղին այժմհամարվում է ներերկային թմրամոլությունը սեռական -ճանապարհը ընդ որում
ավելի հաճախ թոխնցվում է համասեռամոլ տղամարդկանց մոտ և պերինատալ նոզոկոմիալ ճանապարհներովևս
հնարավոր է որ վիրուսը փոխանցվի։
Միաշղթա ՌՆԹ պարունակող վիռուս է վեց գենոտիպ ունի որոնք մեկից վեցը էդպես համարնշվում են և դրանք ունեն
ենթատիպեր բջիջ միջնորդավորված իմուն պատասխան է երկբերան թրի ֆենոմենը որիմասին խոսեցինք հեպատիտ Բի
դեպքում այստեղ ևս կիրառելի է, վիռուսի կանխարգելում այսինքն արդյունավետ վակցինա ցավոք սրտի դեռևս
հասանելի չէ սակայն այժմ ունենք բարձր արդյունավետությամբ բուժում և կարող ենք հասնել վիռուսի բացարձակ
էմինիլացիայի։ Լյարդի ոչ ալկոհոլային ճարպային հիվանդութունը կամ լյարդի մետաբոլրիկ ասոցացված դա ոչ
ալկոհոլային հիվանդություն է որի դեպքում դիտվում է լյարդում ճարպի ավելցուկային կուտակում, որը կապված է
ինսուլինկայունության հետ։ Լյարդի փոխպատվաստման կարիք ունեցող պացիենտների, ամբողջ աշխարհում
փոխպատվաստման կարիք ունեցող պացիենտների երկրորդ ամենհաճախ հանդիպող պատճառը հենց լյարդի ոչ
ալկոհոլային ճարպային հիվանդությժունն է առաջին տեղը պատկանում է խռոնիկ հեպատիտ Ց վարակին։
տարածվածությունն աշխարհում կազմում է մինչև 25 տոկոս, տարբեր աշխարագրական ռեգիոններում
տգարածվածութնյունը տարբեր է պետք է նշել, որ շատ բարձր է տարածվածությունը օրինակ ամերիկայի միացյալ
նահանգներում ։ Ճարպի ավելցուկային կուտակումը լյարդում արձանագրվում է եթե այն առկա է հեպատոցիտների
ավելի քան 5 տոկոսում,մի շարք բիոքիմիական և իմունոլիական մեխանիզմները որկարատև այդ մեխանիզմների
առկայությունը բերում է լյարդի աստղաձջև բջիջների ակտիվացման որը բերում է կոլագենի կուտակման և լյարդի
ֆիբրոզի այն մեխանիզմով որի մասին արդեն խոսել ենք։

Կոլագենը սկզբում կոըտակվում է պերիսինուսոիտալ հատվածում լյարդային ացինուսի երրորդ
զոնայում։Պրոգրեսիայի ընթացքում առաջանում է նաև պերիպորտալ կոլագենի կուտակում, լյարդի պրոտենիգոլ
բջիջների ակտիվացմամբ։ Ֆիբրոգենեզի արտահայտվածությունը կեռոլյացիայի մեջ են գտնվում
ինսուլինակայունության աստիճանի հետ ։ Զարգանում է անոթների պարեքիմիայի արխիտեկտոնիկայի ռեմոդելավորւմ
խորտալ տրակտերըև լյարդային երակները միանում են կոլագենային ձգաններով և զարգանում է լյարդի ցիրոզ որն
էլ կարող է հանգեցնել լյարդային անբավարարությանը և լյարդաբջջային քաղցկեղի։
Լյարդի ալկոհոլային հիվանդությունը ևս համարվում էլյարդի ցիրոզի ամենահաճախ հանդիխպող հիվանդության
պատճառներից մեկը երեք պատճառներից մեկը, ալկոհոլի չաևաշահումը համարվում է աշխարհում ընդհանուր
մահերի 5,9 տոկոսի պատճառը ալկոհոլի չարաշահումը և դրա հետևանքները և բարդությունները։ Ալկոհոլի
չարաշահումը շատ տարածված է եվրոպայում, միջինում մեկ անձը տարեկան խմում է 11 լիտր ալկոհոլ։
Հիվանդության հիմանակն ընթացքը կազմված է մի շարէ փուլերից առաջինը ստեատոզն է, որին հաջորդում է
ստեատոհեպատիտը արդեն լյարդաբջջային նեկրոզաբորբոքմամբ, այնուհետև ֆիբռոզը և երկու լյարդի ցեռոզ։ Պետք
է նշել, որ լյարդի ալկոհոլային հիվանդություն ունեցողների շրջանում մինչև 35 տոկոսի մոտ ի վերջո առաջանում է
լյարդի ցիրոզ։
Այստեղ ցուցադրված է տաբեր երկրներում եվրոպական տարբեր երկներում ալկոհոլի կիրառման ստատիստիկան
օրական ալկոհոլի կիրառումը, կարեղ ենք տտեսնել որ 8,4 տոկոսը եվրոպայի բնակիչների ամեն օր ալկոհոլկ է
օգտագործում և ի հակադրություն դրան 26,2 տոկոսը վերջին 12 ամսվա ընթացքու ալկոհոլ րեն օգտագործել։ Եվ
տարածվածությունը տարբեր է պետք է նշել․ որ Ռուսաստանում օրինակ տարածվածությունը 11-12 տոկոս է։
Պատոգենեզը, այստեղ տարբեր գործոններ դեր ունեն առաջինը ռեդոքս տատուսի փոփոխությունն է, ճարպերի
մետաբոլիզմին մասնակցող տրանսկրիպցայի գործոնների հավսարակշռության խաղտումը ինչպես նշեցինք ստեատոզն
էր առաջին փուլում , այսինքն ճարպերի մետաբոլիզմի փոփոխությունը է հիմնական պատթոլիկ գենոմի օղակը
կարելի է համարել, օքսիդատիվ սթրեսը, աղիքային թափանցելիության բարձրացումը լիպոպրոտեյիններով
ինդուկցված բորբոքումը, և շատ կարևոր է այստեղ առանձնացնել նաև նեո-անտիգենների ձևավորումը քանիոր
լյարդի ալկոհոլայյին հիվանդության դեպքում բացի օղակի տոքսիկ ազդեցությունից գոյություն ունինաև իմուն
միջնորդավորված ազդեցություն երբ տեղի է ունենում հեպատոցիդների կազմի փոփոխություն , նրանք կապվում են
տարբեր անտիգեների հետ և փևավորվում են նեո-անտիգեններ և այս դեպքում օրգանիզմն արդեն օտար ճանաչելով
հեպատոցիդները արտադրում է հակամարմիներ իրականում նեո-անտիգենները վերացնելու համար։
Այս սլայդում ցուցադրված է լյարդի ալկոհոլային հիվբանդության դեպքում լյարդի միկրոսկոպիկ պատկերը լյարդի
ալկոհոլային հիվանդության ժամանակ հմնականում մանր հանգուցավոր ցիրոզ է նկատվում որը հետագայում
պրոգրեսային զուհագահեռ փոխրինվում է խոզոր հանգուցավոր ցիրոզի մակրոնուդուլյար ցիրոզի,իսկ ինչպես գիտենք
մակրոնուդուլյար ցիրոզը բարձր ռիսկի հեպատոցելյար կարծինում է ձևավորման համար։ Այս պատկերում տեսնում
ենք միառժամանակ և մանր հանգույցների առկայություն և նաև այստեղ երևում են միջին տրամաչափի հանգույկցներ
և արդեն խոշոր հանգույցների առկայություն և իհարկե ֆիբրոզ ստեպտաներ։
Վիլսոնի հիվանդությունը լյարդի կուտակային մետաբոլիկ հւվանդություններից մեկն է այն ժառանգական
հիվանդությունն է աուտոսոմ ռեցեսիվ ձևով փոխանցվող պայմանավորված է ԱՏՊ7Բ սպիտակուցի մուտացիայի հետ

որը պատասխանատու է այս սպիտակուցւ պղնձի մետաբոլիզմի համար պղնձի էկսկրեցիայի համար մասնավորապես
հեպատոցիտներից հանդիպման հաճախականությունը մեկի հարաբերությունը եևեսունհազարի, տղամարդկանց և
կանանց մոտ տարածվածությնուը նույնն է, այս դեպքում բարձր է պղնձի քանակը օրգանիզմում և այն կուտակվում է
տարբեր հյուսվածքներում, իսկ ահա ցերուրոպլազմի քանակը նվազած է։
Պղնձի կուտակում դիտվում է լյարդում գլխուղեղում և այլ հյուսվածքներում հիմքը պղնձի ոչ այդքան ներծծման
խանգարումն է ուժեղացումն է բարակ աղիներից որովհետև համարվում է որ վիլսոն հիվանդության դեպքում այս
օղակում փոփոխություններ կարող ենք չունենալ այլ հիմքը դա լյարդով պղնձի էքսկրեցիայի խանգարումն է։
Գենետիկ դեֆեկտը ազդում է լյարդում պղնձի տեղափոխող ադենոզին տրիֆոսֆատազա գենի վրա։ Վիլսոնի
հիվանդությունը հիմնականում լյարդային դրսևորումներով է ուղեկցվում, եթե կյանքի առաջին տասնամյակում է
պացիենտը գտնվում, այնուհետև նյարդային դրսևորումները սովորաբար միանում են երրորդ տասնամյակից
հետո։Չնայած որ հիվանդության դրսևորումները սկսվում են մանկական տարիքից սակայն շատ հաճախ այս
հիվանդությունները ախտորոշվում է մեծահասակների պրակտիկայում։
Այստեղ սխեմատիկ ցուցադրված է Վիլսոնի հիվանդության պատոգենեզը, ինչպես տեսնումենք հիմնական խնդիրը
տեղակայված է այդ ԱՏՊ 7Բ դեֆեկտի սպիտակուցի մակարդակում որը պատասխանատու է պղնձի արտազատմանը
դեպի լեուղինե, այս պրոցեսը նոռմալ տեղի չի ունենում և ցերուրոպլազմինի դեֆիցիտը որի մասին արդեն խոսեցինք։
Պղինձ պարունակող սննդամթերքները ճանաչելը շատ կարևոր է քանի որ բոլոր այն պացիենտները որոնք ունեն
Վիլսոնի հիվանդություն պետք է խուսափեն այս սննդամթերքների կիրառումից։Դրանք առաջինը ծովամթերքներն են,
կենֆանական լյարդը, սունկը, ընդեղենը, շոկոլադը, լոբազգիները՝ լոբին սիսեռը, ջրի օգտագործումը եթե օրինակ
ջուրը հոսել է պղնձե խողովակներով։ Այս գործոնին ևս պետք է շատ ուշադրություն դարձնել։Արտազատումը պղնձի
ավելցուկը սովորաբար լեղու կազմով դուրս է գալիս օրգանիզմից, պղինձ –կախյալ ֆերմենտներ գոյություն ունեն
մեր օրգանիզմում,որոնք ֆունկցիոնալ շատ կարևոր նշանակություն ունեն, դրանցից առաջինը ցերուրոպլազմինը,,
թիրոզինազան, ցիտոքրոմ Ց օքսիդազան, դոպամին բետա հիդրոքսիլազը։
Եվ Վիլսոնի հիվանդության ստադիաները չերս ստադիա ենք առանձնացնում առաջինը երբ ունենում ենք պղնձի
կուտակում դեռևս միայն լյարդում, երկրորդ փուլում պղնձի վերաբաշծխում է տեղի ունենում և արյան
շրջանառութնունով պղինձը տարածվում է նաև այլ օրգաններև հյուսվածքներ, երրորդ փուլում արդեն ունենում ենք
պղնձի կուտակում գլխուղեղում, որտալյարդային հյուսվածքներում հիվանդությունն այս փուլում պրոգրեսիվում է։ Եվ
րոևոևդ փուլը դաս պղնձի բալասնի կարգավորումն է պայմանավորված խելատային երկարատև բուժմամաբ։
Վիլսոնի հիվանդության դեպքում հիվանդութան դրսևորումները բացիլյարդից նաև այլ օրգանների ընդգրկմամբ է
աչքի ընկնում։ Կարեղ եոնք տեսնել եր օրինակ ոսկրային համակարգի ընդգրկում կարող ենք ունենալ օստրեոպորոզ,
արթրիտ , հեմուլիզ որի մասին առանձին կխոսենք, կենտրոնական նյարդային համակարգի ախտահարում ւ որի
երկրորդ հաճախ հանդիպող դրսևորումներն են լյարդի ցիրոզից հետո, այն ներառում է շարժողական համակարգի
խանգարոււմներ, դող, ակամա շարժումներ, դիսարթիա, կարծր դիստոնիա, պսեդոբուլբար ախտահարումներ, ինսոմիա
և այլն։ Աչքերի ախտահարում այդ կայզեր ֆլեշերի օղակները որոնք շատ հայտնի են և շատ բնորոշ են Վիլսոնի
հիվանդությանը, ցրտի ախտահարում, կարդիոմիոպաթիա, սրտի ռիթմի խանգարումներ և երիկամների ախտահարումէ
նեֆրոլիթիազ, ֆանկոնիի համախտանիշ ։

Հեմոլիզը կումբս բացասական հեմոլիտիկ անեմիան կարող է կապված լինել Վիլսոնի հիվանդության հետ , ընդ
որում այս անեմիալ հիվանդությունը կարող է առաջին էպիզոդը լինել Վիլսոնի հիվանդության զգալի մեմոլիզը
հիմնականում կապված է լյարդի լուրջ ախտահարման հետ արդեն, լյարդի բջիջների քայքայումը արող է բերել մեծ
քանակությամբ կապված պղնձի անցմամբ արյուն , որն ավելի է խորացնում հեմոլիզը, դեղնուկով հիվանդների մեկ
չորորդը նույնպես նշում է որ ունեցել է հեմոլիզ, կամ նրանց մոտ հայտնաբերվում է հեմոլիզի առկայությունը
փաստագրված հետազոտություններով։ Նյարդային սիմպտոմներով որոշ սիմպտոմներ հիվանդներ նշում են, որ
նախկինում ունեցել են դեղնուկ, որը հավանաբար կարելի է կապել հեմոլիզի էպիզոդների հետ։

Հոգեբանակն խնդիրներ ևս կարող են դիտվել Վիլսոնի հիվանդության դեպքում, դեպրեսիա, փսիխոզներ , անձի
խպանգարումներ, բիպոլյար խանգարոմներ, էնդոկրին խանգարումներ, հիպոպարաթերիոզ , ստամոքսաղիթային
ախտահարումներ դրանց մասին արդեն խոսեցինք, հատկապես լյարդի ախտահարումը սկզբնական փուլերում մենք
ունենում ենք հեպատոմեգալիա, իսկ ցեռոզի զարգացման դեպքում արդեն կարող է լյարդը չափերով փոխվել ,
սպենոմեգալիա, ճարպային լյարդ, սուր հեպատիտ, լյարդի ցեռոզ, լյարդային անբավարարություն, պանկրեատիտի
առաջացումը և գինեկոլոգիական խնդիրներ դաշտանային ցիկլի խանգարում և անպտղություն ևս կարող է դիտվել։
Առաջնային բիլիար խոլանգիտը ևս համարվում է լյարդի ցեռոզի պատճառներից մեկը այն նախկինում կիոչվում էր
առաջնային բիլիար ցիռոզ, աուտոիմուն հիվանդություն է, որը դրսևորվում է փոքր և միջին տրամաչափի
ներլյարդային լենուղիների աղտահարմամբ, առավել հաճախ հանդիպում է կանաց շրջանում։
Առաջնային բիլիար խոլանգիտը ըստ Լյուդվիգի դասակարգվում է չորս փուլերի, առաջին փուլում երբ ունենք
պորտալ աղտահարում, առկա է պորտալ շրջանի բորբոքում լեղուղիների անոմալիա, երկրորդ փուլում արդեն ունենք
պերիպորտալ աղտահարում, առկա է պերիպորտալ ֆիբրոզ բորբոքու արտահայտված և կարող է դիտվել նաև առանց
բորբոքման , երրորդ փուլը դա սեպտալ ֆիբրոզների առկայությունն է ակտիվ բորբոքմամբ, և չորորդ փուլը արդեն
լյարդի ցեռոզի առկայությունն է ։
Բնորոշ նշաններն են հեմատոմեգալիան, սպլենոմեգալիան, դեղնուկը, հիպերպիգմետացիան, քսանթելազմաները,
Շյոգրենի համախտանիշը։ Քսանթելազմաններրը դրանք բարօրակ գույացություններն են մաշկի որոնք հուշումեն
խոլեստերինի բարձր մակարդակի և օրգանիզմում ընդհանուր ճարպային նյութափոխանակության խանգարման հետ։
Դեղնուկը հիմնակաւոնւմ վաղ փուլերում պայմանավորված կոնուգացված հիպերպելիռումինիայով քանի որունենք
արտահայտված խոլեստազ։
Հեմքրոմատոզը դարձյալ համարվում էլյարդի կուտակային հիվանդություններից մեկը պարենխիմատոզ օրգաններում
երկաթի կուտակումն է , ամենատարածված աուտոսոմ ռեցեսիվ գենետիկ հիվանդություն է համարվում և երկաթի
կուտակման ամենատարածված պատճառը աշխարհում։ Վիլսոնի հիվանդությունը դրսևորվում է դասական տրեադայով
որը ներառում է յարդի հիվանդությունը բռոնզագույն մաշկը և շաքարային դիաբետը, այսինքն ենթաստամոքսային
գեղձի աղտահարումը։ Լյարդի աղտահարումը կարող է դրսևորվել սովորական հասարակ հեպատոմեգալիայից որը
դիտվում է 13 տոկոս դեպքերում և մյուս տարբերակը լյարդի ցեռոզի դրսևորումն է որը ևս դիտվումէ դեպքորի
13տոկոսում։ Բռոնզագույն մաշկը կամ հիպերպիգմենտացիան ամենահաճախ հանդիպող դրսևորումն է պացիենտների
յոթցուն տոկոսն ուննի բռոնզագույն մաշկ մինչև 70 տոկոսը շաքարային դիաբետը որը դիտվում է 48 տոկոս

դեպքերում ։ Կարող է հանդիպել նաև ատրոպաթիա, ամենորեա, իմպոտենցիա, հիպոգոնադիզմ,
կարդիոմիոպաթիաներ և այլ դրսևորումներ։
Ցիռոզի առաջնային պատճառը առաջնային սկրելոզացնող խոլանգիտն է, որըդարձյալ համարվում է լյարդի
աուտոիմուն հիվանդություններից մեկը այնպես ինչպես առաջնային բիլիար խոլանգիտը,դրսևորովում
էարտալյարդային ևր ներլյարդային լեղուղիների աղտահարմամաբ, որոնք ի վերջո բերում են լյարդի ֆիբրոզր և
ցիռոզի առաջացմամբ։ Առավել հաճախ հանդիպում է երիտասարդ և միջին տարիքի տղամարդկանց մոտ ի
տարբերություն առաջնային բիլիար խոլանգիտի ։ Առաջնային սկրելոզացնող խոլանգիտով պացիենտների մինչև 90
տոկոսը ունեն աղիների խռոնիկ բորբոքային հիվանդություն և հատկապես խոցային կոլիտ։
Լյարդի դեղորայքային աղտահարումները, դեղերը որոնք առաջացնում են սուբմասիվ հեպատոցելյուլար վնասում,
կարող են բերել ֆիբրոզի որը կհարաճի լյարդի ցիռոզի, որոշ դեղեր կարող են բերել կոլագենի կուտակման այսինքն
աստղաձև բջիջների ակտիվացվման և կոլագենի կուտակման առանց նախորդող նեկրոզի բորբոքման նշանների։
Լյարդի ցեռոզ առաջացման դեղորայքներից է հատկապես մետոտրեքատը , իզոնեաղիտը, էնալապրիտը։
Աուտոիմուն հեպատիտը լյարդային խռոնիկ նեկրոզաբորբոքային հիվանդությունն է, որը բնորոշվում է
հեպատոցիտների անտիգենների նկատմամբ, իմուն տոլերանտության կորստեվ, բնութագրվում է իմուն-
միջնորդավորված բորբոային պրոցեսի առաջացմամբ որը դանդաղ պրեգրեսիվորվելով ի վերջո բերում է լյարդի
ֆիբրոզի և ցեռոզի առաջացման;
Տարբերում ենք աուտոիմուն հեմատիտի երկու տիպ, առաջին տիպի դեպքում նկատվում են հականուկլեար և
հակակորիզային հակամարմիններ և հարթ մկանաթելիկների նման հակամարմիններ և առանձնացվում է նաև երրորդ
ենթատիպը այսինքն երրոդ տիպը որը համարվում է աուտոիմուն հեպատիտի առաջին տիպի ենթատիպ լյարդի լուծվող
անտիգենի և լյարդ պանկրեատիկ լուծվող անտիգենի նկատմամբ հակամարմիններ։ Պետք է նշել որ առաջին տիպի
աուտոիմուն հեպատիտը հանդիպում է երիտասարդ կանանց շրջանում այն հեշտ է ենթարկվում բուժման, պրոգնոզը
համեմտաբար լավ է ․ եթե երկրորդ տիպի հետ համեմատենք և սովորաբար երկար տարիների բուժումից հետո
ռեցիսիվը ավելի հազվադեպ է հանդիպում։
Երկրորդ տիպը ունենում ենք լյսրդ երիկամ միկրոսոմալ անտիգենի նկատմամաբ տիպ մեկ անտիգենի նկատմամբ
հակամարմիններ երբեմն տիպ երեքի նկատմամաբ հակամարմիններ և երկրորդը լյադքի ցիտոզոլային անտիգենի
նկատմամբ հակամարմիններ, երկրորդ տիպի աուտոմինում հեպատիտը աչքի է ընկնում ավելի բարդ ընթացքով
հանդիպում է մանկական տարիքում արագ պրոգրեսիվում է և առաջացնում է լյարդի ցեռոզ և պրոգնոզը երկրորդ
տիպի աուտոիմուն հեպատիտի դեպքում ավելի վատ է քան առաջին տիպի դեպքում ։
Այստեղ ցուցադրել եմ աուտոիմուն հեպատիտի աղտորոշման սանդղակը, որը օգտագործվում է ամբողջ աշխարհում ,
այստեղ որոշվումեն տարբեր միավորներ ելնելով տարբեր իրավիճակներից և ստացված միավերնրի գումարով
պացիենտը գտնվելու է կամ հավաստի կամ հավանական միջակայքում ասուտոիմուն հեպատիտ ունենալու համար։
Այստեղ առաջինը սեռն է ինչպես նշեցինք ասուտոիմուն հեպատիտը դա կանաց իվանդություն էերկրորդը խոլեստազի
բացակայությունըայուհետև ընդհանուր գլուբոլինի կամ իմունոգլուբոլին Ջ իմակարդակը պետք է որոշել,
աուտոհակամարմինները պետք է որոշել։ Ընդ որում ԱՆԱ կամ անտիմիտոխոնդրեալ հակամարմինները դրական են
այս դեպքում ինչպես տեսնում ենք միանգամից 4 միավոր հանվում է ստացված միավորներից, այսինքն

հավանականությունը իջնում է որ այստեղ առկա է աուտոիմուն հեպատիտ և սա խոսում է ավելի շատ լյարդի
առաջնային բիլիար խոլանգիտի մասին համարվում է նրա ավելի սպեցիֆիկ առաջնային բիլիար խոլանգիտի
ցուցանիշ, սակայն պետք է նշել օվեռլապ սինդրոմների մասին երբ կարող են զուգակցվել տարբեր
աուտոհակամարմիններ և լյարդի տարբեր աուտոիմուն հիվանդություններ, օրինակ աուտոիմուն հոպատիտ կարող է
զուգակցվել առաջնային բիլիար խոլանգիտի հետ և այս դեպքում կունենաք և ԱՄԱ և ԱՍՄԱ կամ այլ աուտոիմուն
հեպատիտի սպեցիֆիկ աուտոիմուն հակամարմիններ և անտիմիտոխոնդրեալ հակամարմիններ։ Հաջորդը
վիրուսայինհեպատիտներն են դարձյալ պետք է տեսնենաք, որ եթե դրական են վիրուսային հեպատիտներից մեկը այս
դեպքում քչանում են պացիենտի մոտ շանսերը որ դարփյալ առկա է աուտոիմուն հեպատիտ, հեպատոտոքսիկ
դեղորայքի կիրառումը նույն սկզբունքով սլկեհելի կիրառում դարձյալ նույն սկղբունքով, լյարդի հիստոլոգիալ
պատկերը, լյարդի բիոպսիան ունի շատ կարևոր նշանակություն աուտոիմուն հեպատիտ աղտորոշելու համար և
այստեղ բնորոշ նշաններից է հայտրոզեթինգի կամ վարթակի ֆենոմենի առկայությունը էմպերիպոլեզը, ինտերֆես
հեպատիտւը կամ այլ ցուցանիշներ։
Այլ աուտոիմուն հեպատիտների հիվանդությունների առկայությունը որոնքն զուգակցվում ե նաուտոիմուն հեպատիտի
հետ հաճախ հատկապես թիրոիտի դեմ;
Պերտալ հիպերտենզիան համարվում է լյարդի ցիռոզի հիմանակն դրսևորումներից և բարդություններից մեկը,
զարգացման պաթոգենեզիկ օղակում ունենք դինամիկ և մեխանիկական կոմոնենտներ։
Մեխանիկական կոմպոնենտը ներառում է շարակցական հյուսվածքիկուտակում, ռեգեներացիոն հյուսվածքների
ձևավորում, բերում է լյարդի նոռմալ արխիտեկտուրայի խանգարման և անոթային հունի վերակառուցման։ Դինամիկ
կոմոնենտը երկու հզորագույն ակտիվ բիոգեն ակտիվ նյութեր է կիրառում առաջինը էնդոթելին մեկն է և
անգիոտենեզիեն երկրորդը։ Ինչպես գիտենք սրանք հզոր անոթասեղմիչներ են և կուտակվելով լյարում բերում են
սինուսոիդների և լյարդային երակների լուսանցքի նեղացման կծկման հետևանքով և առանձնահատուկ պետք է
խոսել ազոտի օքսիդի մասին , ազոտի օքսիդի տեղային ներլյարդային սինթեզը խանգարված է պայմանավեորված
սինուսոիդալ էնդոթելում էնոյի սինթեզի համար պատասխանատու էնոսինթեզատեի ակտըիվացման նվազմամբ։
Արդյունքում ուենենում ենք նորլյարդային էնոյի մակարդակի իջեցում , իսկ գիտենք էնոն ունի կարևոր անոթային
լայնիչ դեր իսկ այս պարագայումստացվում է որ պորտալ հիպերտենզիայի դինամիկ կոմպոնենտների էնդոթերլ մեկին
և անգիոտենեզին երկրորդի բարձր ավելցուկի ֆոնին ունենում ենք էնոյի մակարդակի իջեցում որն էլ ավելի է
նախատրամադրում պորտալ հիպերտոնզիայի առաջացմանը։
Այլ գործոնները ևս ունեն նշանակություն սպլանխիկ կապ պերիֆելիկ ընդերային արտերիոլների վազոդիւլատացիան
պայմանավորված դեպի արյուն հուն հավելյալ քանակությամբ ձերբազատվող էնդոգեն վազոդիլյատատոր նյութերով ։
Սպլանխիկ վազոդիլատացիան բերում է պերիֆերիկ անոթների դիմադրության անկման և զարկերակային ճնշման
իջեցման ։ Արդյունքում ունենում ենք շրջանառվող արյան էֆեկտիվ ծավալի նվազում և ունենում ենք տարբեր
օրգաններում պերֆուզիայի խանգարում ։ Երիկամներում պերֆուզիայի խանգարումը ինչպես գիտենք դրսևորվում է
իլդյուքսոտագլոմերալ համակարգում ռենինի ակտիվացմամբ որը բերում է ի վերջո ռենին անգիոտենեզի
ալդոստրեոնային համակարգի թողարկման ։ Ինչպես գիտենք այս համակարգի վերջին օղակը ալդոստերոնը
պատասխանատու է նատրումի և ջրի պահման համար և այսպես կոչված կոմպեսատոր մեխանիզմի շրջանակներում
ալդոստերոնը բերում է նատրումի և ջրի պահման մեծացման։ Արդյունքում վաղ փուլերումլյարդի ցեռոզի այս
մեանիզմը բերում է շրջանառվող արյան ծավալի պահպանման էֆեկտիվ ծավալի պահպանման, սակայ պրոցեսի

հառաճմանը զուգահեռ սա դառնում է դեկոմպեսացիայի մեխանիզմներից մեկը և նպաստում է օրինակ մեխ
քանակությամբ ասցիտի կուտակմանը ։
Դռներարկային համակրգում գերբեռնվածոըթյունը բեռնաթափելու նպատակով ձևավորվում են պորտոկավալ
անաստամոզներ ներ և արտալյարդային։ Դրանցից երեք հիմանակն խոշոր անաստամոզներն են կերակրափողի
ստորին երորդականում տեղակայված գաստրոէզոֆագեալ անաստամոզները, որովայյնի առաջնային պատում
տեղակայված անաստամոզները, հարպորտային շրջանում որոնք հիշեցնում են մեդուզայի գլուխը կապույտ մեդուզեֆ
ֆենոմենը և ուղիղ աղում ձևավորված անաստամոզները։ Առկա են նաև անաստամոզներ հետորովայնամազային
պորտո կավալ համակարգերի միջև, անաստամոզներ երիկամային և թոքային երակների միջև։
Վարիկոզ լայնացած երակներից արյունահոսությունը համարվում է լյարդի ցեռոզով պացիենտների մահվան
հիմնական պատճառտներից մեկը ։ Ընդ որում ռիսկը էլ ավելի բարձրանում է եթե լկժյարդի աղտահարումը ավելի
ծանր է օրինակ չայլ պլյու ց դասի դեպքում որը համարվում է ամենածանր դասը այս դեպքում վարիկոզ լայնացած
երակներից արյունահոսության դեպքը շատ բարձր է։ Եվ մյուսը եթե էնդոսկոպիկ տեսնում ենք այդ վարիկոզ
լայնացած երակների վրա կարմիր բծերի հատվածներ որոնք թույլ դիմադրության տեղեր են և այդ հատվածներից
հաճախ դիտարկվում է արյունահոսության առաջացում։
Ասցիտի զարգացման հիմանակն պաթոգենետիկ մեխանիզմները, այստեղ մի քանի մեխանիզմների համադրություն
ունենք առաջինը դա պորտալ հիպերտենզիայով պայմանավորված լիմֆատիկ համակրգի ծանրաբեռնվածությունն է
գերծանրաբեռնվախությունը։ Լիմֆատիկ անոթների դիլատացիան նրանցում արյան ճնշման բարձրացումը հեղուկի
ներծծումը լյարդի մակերեսից արդեն բերում է որովայնի խոռոչ դեպի արտահոսք ը բերում է ուղղակի մեխանիկակն
կուտակման որովայնի խոռոչում։ Պերիֆերիկ արտերիալ դիսլատացիան երը ինչպես նշեցինք բերում էր ի վերջո
ռեինագիոտենզինալ համակարգի ակտիվացման ւև չնայած այս անոթային գերծանրաբեռնվածությունը արդեն
ունենում ենք նատրիում և ջրի պահում որը բերում է հավելյալ հեղուկի կուտակման ։ Եվ հիպոալբումինեմիան արյան
օնկոտիկ ճնշման անկումը սա նպաստում է հեղուկի դուրսբերմանը անոթային հունից համարվում է հիմնական
գործններից մեկը սակայն ոչ ամենակարևորը ։
Լյարդային էնցեֆալոպացիան դա դարջյալ լյարդի ցեռոզի հաճախ հանդիպող և լուրջ բարդություններից մեկն է
հանդիսանում ։ Լյարդի ցեռոզ աղտորոշելու պահին պացիենտենրից 10-14 տոկոսը արդեն ունեն սիմտոմատիկ
լյարդային էնցեֆալոպատիա։
Մինիմալ կամ թաքված լյարդային էնցեֆալոպատիա դիտվում է պացիենտների մինչև 80 տոկոսի մոտ , ինչպես
գիտենք մինիմալկամ թաքնված էնցեֆալոպաթիան հայտնաբերելու համար օգտագործվում են այդ
ներոպսիխոլոգիական տարբեր տեսերը, օրինակ մատիտ և գրիչիտեստը և այլն։ Լյարդային էնցեֆալոպատիայի
առաջացումը կախված է ռիսկի գործոնների առկայություններից,օրինակ եթե դիտարկվել է վարիկոզ լայնացած
երակներից արյունահոսություն եթե դիտվել է ասցիտի հարաճում, եթե դիտվել է հատկապես հեպատիտ ց ով
պայմանավորված լյարդի ցիրոզը էնցեֆալոպատիան քանի որ համարվում է որ հեպատիտ ց ի հարուցիչը ունի նաև
նեյրոտրոպիզմ բացի հեպատոտրոպիզմից , դիուրետիկների գերդոզավորումը, վարակների առկայությունը
փորկապությունը և շաքարային դիաբետը ։ Այս բոլոր գործոնները կարող են պրովոկացնել ինդուկցել լյարդի
ցիրոզով պացիենտիմոտ էնցեֆալոպատիայի դրսևորմանը։

Եվ դասակարգում ենք լյարդային էնցեֆալոպատիան ելնելով պատրառային և պաթոգենետիկ գործոնից, այն կարող է
լինել կապված սուր լյարդային անբավարարության հետ , կարող է պայմանավորված լինել պորտոսիսիտեմիկ
շունտավորման առկայության հետ ,և երրորդ տարբերակը լյարդի ցիրոզի դեպքում առաջացած լյարդայյին
էնցեֆալոպատիան է։ Պետք է նշել, որ ցեռոզի դեպքում առաջացած լյարդային էնցեֆալոպատիան ներառում է նաև
նախորդ երկու կոմպոնենտները այսինքն էնցեֆալոպատիայի առաջացումը կապված է և պորտոսիսիտեմիկ
շունտաերի ձևավորման հետ և լյարդաբջջային անբավարար աշխատանքի հետ։
Ենթադրյալ տոքսիները որոնք բերում են լյարդային էնցեֆալոպատիայի առաջացման դրանցից ամենքննարկված և
ամենաուսումնասիրվածը ամոնիակն է այնուհետև մանգանը քանի որ լյարդայյին էնցեֆալոպատիա ունեցող
պացիենտների մոտ կամ լյարդային կոմայից մահացած մոտ գլխուղեղում նկատվում է մանգանի հավելյալ կուտակում
և դա կարելի է տեսնել մաը ՄՌՏ հետազոտությամբ։ Գամմա ամինոկարագթթուն, որը ինչպես շատ հայտնի
արգելակից նեյրոտրանսմիտոր է, կարճ շղթայով ճարպաթթուները, մերկապտանները, ֆենոլները և այլն։
Լյարդի ցիրոզի կլինիկան տարբերում ենք երկու փուլ կոմպեսացված փուլ, որը հիմանականում անախտանիշ է կամ
այս փուլում կարող ենք ունենալ լյարդի հիմնական հիվանդության նշանները և դեկոմպեսացված փուլ, որը արդեն
դրսևորվում է լյարդի բարդությունների առկայությամբ։ Պորտալ հիպերտենզիայով պայմանավորվածասցիտի,
կերակրափողի վարիկոզ լայնացած երակների կամ դրանց արյունահոսությամբ , կարող ենք ունենալ
կոագուլապատիայի նշաններ, արյունազեղումներկոպտուկներ մարմնի տարբեր հատվածներում, լյարդային
էնցեֆալոպատիայի նշաններ ընդուպ մինչև լյարդային կոմայի զարգացում։
Դեղնուկի պատճառները լյարդի ցեռոզի դեպքում նախ հիշենք բիլիռումինի մետաբոլիզմը հակիրճ, ինչպես գիտենք
անուղղակի բիլիռուբինը արյան ընդհանուր փուլում շրջանառվում է կապնված լինելով ալբումինի հետ։ Այնուհետև
այս կազմությունը զավթվում է լյարդի կողմից այիսնքն կապվու է լյարդի կողմից որ ը շատ կարևոր ֆունկցիա է
հանդիսանում, այնուհետև լյարդումայն անջատվում է ալբումինից և գլուկոնացվում է այսինքն տեղի է ունենում
կոմունիկացիա, և ի վերջո այդ կոնուգացված բիլիռուբինը հատուկ ռեցեպտորների միջոցով որը կոչվում է
մուլտիգռադ ռեսիստենտ այսինք բազմադեղորայքակայուն ռեզիստենտ ռեցեպտոր , այդ ռեցեպտորներով
արտազատվում է դեպի 12 մատնյա աղիք։ Այս համակարգում այս պրոցեսում ցանկացած օղակում ֆունկիցոնալ
խաթարման դեպքում կարող է առաջանալ դեղնուկ։
Լյարդի ցեռոզի դեպքում ունենում ենք և լյարդի կեղմից հեպատոցիդների կողմից պիլիռուբինի կապման խանգարում
և կոնուգացիայի խանգարում և արտազատման խանգարում օրինակ եթե ունենք ռեգեներացիոն հանգույցներ լյարդի
ֆիբրոզ փոփոխություն կամ եթե արդեն զարգացել է հեպատոցինյալ կարդիումը այս դեպքում կունենաք երրոդ
օղակում խանգարում, այսինքն արտազատման խանգարում։ Մյուս տարբերակը եթե արդեն ունենք հեպատոցիտների
զգալի կորուստ քանակի կորուստ արդեն ուղղակի կոնուգացիան տեղի չի ունենա նոռմալ և այլն, այսպիսով դեղնուկի
պատճառը պայմանավորված է լյարդաբջջային անբավարարությամբ և խոլեստատիկ աղտահարմամբ։
Աստցիտիառաջացումը ևս հաճախ հանդիպող ֆենոմեններից է լյարդի ցեռոզի դեպքումայն դրսևորվումէ
պացիենտների որովայնի չափերի մեծացումով, փքվածությամբ, արտահայտված վքնածության զգացողությունով և
մեզի քանակի քչացումով։ Ասցիտը կարող է ուղեցկվել նաև հեղուկի կուտակմամբ պերիկարդիալ հատվածում
պլևլայի խոռոչում և այլն։ Թարմ արյան, մուգ արյան սուրճի նստվածքի տեսքով, փսխումով պացիենտների դեպքում,

մուգ գույնի կղանք ունեցղպացիենտների դեպքում,մելեյանիդեպքում, սև ձութանման կղանքի դեպքումկամ ծանր
արյունահոսության դեպքում պետք է անպայման հիշել գաստրոէզոֆագեալ վարիկոեզ լայնացած երակների և դրանց
արյունահոսության մասին։
Լյարդի ցեռոզի այլ բարդությունների մասին արդեն նշեցիքն լյարդային էնցեֆալոպացիան, հազվադեպ հանդիպող
հիվանդությնուններից են նաև հեպատոռենալ համաղտանիշը հեպատոպուլմոնալ համաղտանիշը, սպոնտան
բակտերիալ պերիտոնինը, տարբեր վարակների առաջացումը։
Քաշի կորուստը հաճախ հանդիպող հիվանդություններից է այն կապված է սնուցման անբարարության հետ, քնաիոր
պացիենտներից շատերի մոտ նկատվում է ուսագոտու շրջանի մկանների ատրոֆիա նաև կոնքի հատվածում,
ընդհանուր սպիտակուցային փոխանակության խանգարում , մկանների ատրոֆիա, ենթամաշկաին ճարպաջջանքի
հյուծում, մաշկի տրոֆիկ խանգարումների նշաններով։ Մկանների ատրոֆիան շատ կարևոր ֆնեոմեն է բացի քաշի
նվազումից այն նաև ունի դեր լյարդային էնցեֆալոպացիայի պաթոգենեզում։
Լյարդի ալկոհոլայկին ցիռոզի դեպքում ունենք առանձնահատուկ նշաններ դրանցից են հարականջային թքագեղձերի
հիպերտրոֆիան, որոնք հուշում են ալկոհոլի խռոնիկ չարաշահման մասին, դյուպուիտրենի կոնտրակտուրան ,
սիմետիկ պերիֆերիկ նեյրոպաթիան, գինեկոմաստիան և անոթային աստղիկները։ Լյարդային նշանները դրանք այն
նշաններն են որոնք հուշում են լյարդաբջջային անբավարարության մասին, դրանցից առանձնացնում ենք անոթային
աստղիկները լյարդային ափերը կամ պալմառեմիտամ, դյուպյուիտենի կոնտրուկտուրան ։
Լյարդի ցեռոզի դեպքում դիտվող այլ նշաններից են գինեկոմաստիան, մազաթափությունը թմբկափայտի մատերի և
եղունգների ժամացույցի ապակու տեսքով դեֆորմացիան, մաշկի պիգմենտացիան որը հատկապես դիտվում է
կուտակային հիվանդություններից օրինակ հեմոքրոմատոզի դեպքում կամ խոլեստատիկ հիվանդությունների դեպքում
առաջնային բիլիար խոլանգիտի , սկրելոզացնող խոլանգիտի դեպքում , կայզեր ֆլեյշերի օղակները որոնք Վիլսոնի
հիվանդության մասին են հուշում ,մաշկի մակերեսին քերի հետևանքով առաջացած քերծվածքներ որոնք հաճախ
դիտվում են լյարդի խոլեստատիկ հիվանդությունների դեպքում։
Լաբորատոր տվյալները արյան ընդհանուր քննությամբ տեսնում ենք անեմիա հհիմնականումայն լինում է հիպաքրոմ
միկրոցիտար անեմիա դիֆիցիտային որի ամենահաճախ հանդիպող պատճառը րյունահոսությունն է կերակրոփողի
վարիկոզ լայնացած երակներից, և մյուս գործոններից է նաև քրոնիկ բորբոքումների անեմիան որը դիտվումէ
լյարդի ցիրոզի դեպքում պայմանավորված հիմքում ընկած հիվանդության քրոնիկ երկարատև քրոնիկ բորոբքման
առյկայության հետ։ Պետք է նաև հիշել, որլյարդը համարվում է օրինակ պահեստ վիտամին Բ12 ի համար և խռոնիկ
աղտահարման դեպքում այն նույնպես կարող է դեր ունենալ անեմիա առաջացման պաթոգենեզում։ Լեյկոպենիան
լյարդի ցիրոզին բնորոշ է լոյկոպենիայի առկայությունը սակայն հաճախդիտում ենք նաև լեյկոցինոզ որը խոսում է
հավելյալ վարակների երկրորդային վարակների առկայության մասին։ Եվ թրոմբոցիտոպենիան , թրոմբոցիտոպենիան
առաջացման երեք հզոր մեխանիզմ գոյություն ունի չնայած որ կարող ենք ունենալ արյան բոլոր ձևավոր տարրերի
նվազում, սակայն թրոմբոցիտոպենիան շատ հատկանշական է լյարդի ցիրոզի համար։ Պատճառներն են
թրոմբոցիտների արտադրության նվազումը, քանի որ թրոմբոպիոտինը ինչպես գիտոնք արտադրվում է լյարդում,
երկրորդը փայծաղային սեկվեստերացիայի ուժեղացումն է և թրոմբոցիտների դեստրուկցիայի ուժեղացումն է ։
Արյան բիոքիմիական քննությամբ նկատվում է հիպոպրոտեինիմիա և հիպոպալբումինեմիա մակարդելիության արյան

մակարդման համակարգի մակարդման գործոնների դեֆիցիտ հատկապես վիտաին -----գործոնների մասին է խոսքը
հիպերբիլիռուբինեմիա աելտեի և աեստեի մակարդակի բարձրացում, հիմնային ֆոսֆատազաի և
գլյուտամիլտրանսպեպիտիդազայի բարձրացում եթե ունենք խոլեստազ։ Պետք է ուշադրություն դարձնել, որ լյարդի
ֆերմենտների նորմալ մակարդակը խոսքը հատկապես վերաբերվում է ասետեին և աելտեյին չի բացառում լյարդի
ցիրոզ աղտորոշումը այլ ընդհակառակը լյարդի արդեն խորը հիվանդությունների դեպքում առաջադեմ լյարդի ցիրոզի
դեպքում կարող ենք ունենալ նոռմալ մակարդակ և դա վկայում է այն մասին որ որդեն չկան հեպատոցիտներ որոնց
քայքայման արդյունքում ցիտոլիզի արդյունքում արյան մեջ կբարձրանա աեստեի և աելտեյի մակադակը։ Հետևաբար
կարելի է պնդել որ լյարդի արտահայտված ցիրոզի դեպքում եթե ունենք աեստոյի և աելտեյի նոռմալ մակարդակ դա
համարվում է վատ պաթոգենետիկ կամ վատ պռոգնոստիկ նշան։
Արյան սերելոգիական քննությունները հեպատոտրոպ վիրուսների հայտնաբերումն է ներառում հեպատիտտ Բ Ց Դ և
այլն մյուսը աուտոիմուն մարկերների հետազոտություն պպատչառային գործոնների հայտնաբերման համար այն
դեպքերում որ կարծում ենք օրինակ աուտոիմուն հեպատիտ, առաջնային բիլիար խոլանգիտ և այլն։
Ուլտրաձայնային հետազոտությունը շատ արժեքավոր ոչ ինբազիվ և առանց ճառագայթման հետազոտության մեթոդ է
որը լայնորեն կրառվում է լյարդի ցեռոզով հիվանդների մենեջմենտում կարելի է նկատել այս հետազոտությամբ
լյարդի հյուսվածքի խտության հետեռոգենություն և մոդուլյար հանգուցավոր փոփոխված մակերես։ Ցիրոզի ժամանակ
բնորոշ է լյարդր ձախ բլթի գերաճը չորորդ սեգմենտի ատրոֆիան և լեղապարկի փոսության լայնացումը պոչավոր
բլթի հիպերտրոֆիան և կարող ենք տեսնել նաև պորտալ հիպերտենզիա հուշող տարբեր նշաններ դրանցից են ուղիղ
դռներակի տրամագծի չափումը, փայծաղային երակի տրամագծի չափումը և նաև վերին միջընդերային երակի
չափումը և իհարկե գնահատում են նաև փայծաղի չափը որովայնում ազատ հեղուկի կուտակում և այլ ցուցանիշներ ։
Համակրգչային շերտագրությունը ևս կիրառելի հետազոտության մեթոդներ են լյարդի ցիրոզի ժամանակ այս
մեթոդներով կարելի է հայտնաբերել լյարդի հյուսվախքի խտության դիֆֆուզ փոփոխություն , հետերոգենություն,
ռեգեներացիոն հանգույցների առկայություն, սպլենոմեգալիա, պորտալ փայծաղային երակների գնահատում, ասցիտ
և հեպատոցելյեւլար կորտինոմեիա։
էզոֆակոգաստրոենդոսկոպիան պարտադիր հետազոտության մեթոդներից մեկն էլյարդի ցեռոզի դեպքում քանի որ
ինչպես նշեցինք այն կերակրափողի վարկոզ լայնացած երակներով և դրանց արյունահոսությամբ և կարելի է նաև
դիտարկել պորտալ հիպերտենզիվ գաստրոպաթիայի առկայությունը որը ևս հանդիսում է լյարդի ցիրոզի
դրսևորումներից բարդություններից մեկը, կոնկրետ այս նկարում կարող ենք տեսնել որ առկա է կերկրափողի
վարիկոզ լայնացած երակներ չորոդ աստիճան և այս կարմիր բծերը այս մեկը հատկապես սրանք թույլ դիմադրության
կետերն են որտեղից որ շատ հնարավոր է որ տեղի կունենա արյունահոսություն ։
Տրանզիտոր էլաստրոգրաֆիան այս մեթոդը կիրառվում է ֆիբրոզի քանակական գնահատման համար դարձյալ ոչ
ինվազիվ հետազոտություն է, զգայուն և բարձր սպեցիֆիկություն ունեցող մեթոդ է որի նշնորհիվ կարելի է չափել
լյարդի կոշտությունը որոշել ֆիբրոզի աստիճանը , պետք է նշել, որ բորբոքման երակային կանգի ֆոնին
խոլեստազի դեպքում արտահայտված ինֆիլտրացիայի դեպքում ևս լյարդիչ կոշտությունը կարող է փոփոխվել և
ճարպակալման և ասցիտի դեպքում քանի որ մաշկից հեռանում է այսպես ասած չափման խորությունը դարձյալ կարող
ենք սխալ պատասխաններ ստանալ ։ Այսինքն կան բազմաթիվ գործոններ որոնք պետք էհաշվի առնել տրանզիտոր
էլաստոգրաֆիան իրականացնելիս։

Եվ ոչ ինվազիվ մարկերներ ևս կան որոնք կիրառվում են համակարգեր որոնք կիրառվում են լյարդի ֆիբրոզի
գնահատման համար դրանցից են ֆիտ 4 տեսետ ֆիպ տեսետը կապրի տեստը և այլն
Լյարդի բիոպսիան համարվում է ոսկե ստանդարդը լյարդի խռոնիկ հիվանդությունների և լյարդի ցիռոզի
աղտորոշման համար։ Ունենք մետավիր սանդղակը մետավիր դասակարգում ը ըստ որի ֆ զրոն դա ֆիբրոզի
բացակայությունն է որոնց հիմքը նոռմալ առողջ լյարդն է ֆ մեկի դեպքում առկա է ֆիբրոզ պերիպորտալ
հատվածներում պորտալ զոնայում ֆ երկու տարբերակի դեպքում նկատվումէ ֆիբրոզ ֆիբրոզի կուտակում պորտալ
զոնաներում և կամրջակների ձևավորում երրորդ տեսակի դեպքում ֆ երրորդ ժամանակ արդեն կամրջակների քնակը
շատանում է և չորորդ տեսակը արդեն արտահայտված ֆիբրոզն է որը կոչվում է լյարդի ցեռոզ։
Չայլդ պյու տերկոտի դասակարգումը որը լայնորեն կիրառվում է աշխարհում հեպատոլոգների կողմից կիրառվում է
լյարդի ցեռոզի դասը հասկանալու համար ունենք աբևց դասեր և այնունի շատ պրոգնոստիկ նշանակություն։ Այս
սանդղակով դասակարգելու համար հաշվի ենք առնում ասցիտի առկայությունը էնցեֆալոպաիան բիլիռուբինի
մակարդակը, ալբումինի և կարտոպացիայի առկայությունը ։ Համապատասխանաբար միավորներիի գումարման
դեպքում ստանում ենք տվյալպացիենտի ցուցանիշը և դասակարգում ենք նրան այս համակարգում։ Ուղղակի նշեմ որ
օրինակ լյարդի ցիրոզի ց դասը պրոգնոստիկ առումով ամենավատ դասն է և կապված է բարձր մահացության հետ և
մոտակա և հեռակա ապրելիությունն է հաշվում։
Լյարդի ցիրոզի մորֆոլոգիական դասկարգումը միկրոնոդուլյար մակրոնոդուլյար և խառը ինչպես նշեցինք օրինակ
լյարդի ալկոհոլային ցիրոզի դեպքում այն սկղզբում միկրոնոդուլյալ ցիրոզ է հետագայում պրոցեսի հարաճման
զուգահեռ փոխվում է մակրոնոդուլյար,իսկ մակրոնոդուլյար ցիրոզը ասոցացվում է հեպատոցելյուլար կարտինոմայի
բարձր ռիսկի հետ։
Լյարդի ցիրոզը բուժումը հակաֆիբրոտիկ թերապիան այժմ լայն թափով իրկանացնում են բազմաթիվ
հետազոտություններ հակաֆիբրոտիկ թերապիա արդյունավետ մարդկանց վր աստանոլւ համար, ցավոք սրտի
հոտազոտությունները դեռևս սահմանափակվում են կենդանիների վրա փորձարարական կենդանիների վրա դրական
արձանագրությամբ ինչը ոչ մի կերպ չի կարելի պռոեկտել նաև մարդկանց պոպուլյացիայի վրա։ եվ կարող ենք նշել
որ չնայած բազմաթիվ հետազոտությունների բազմաթիվ կլինիկական փորձարկումներին որոնք ուղված են ֆիբրոզի
կուտակման ընկճմանը հեպատոցիդների ընկճմանը պրոբորբոքային ցիտոկինների քանակի ընկճմանը, օքսիդատիվ
սթրեսի ընկճմանը և հատկապես ստելատային բջիջները հանգստացմանը այսինքն ստելատ բջիջների
պրոֆիլորացիան ընկճել , խթանել նրանց ափոփտոզը, խթանել նրանց ակտիվացումը և այլն։
Տարբեր պրեօարատներ են փորձարկվում տարբեր մեթոդներով սակայն դարձյալ պետք է ասեմ որ մարդկանց վրա
արդյունավետությունը դեռևս ցուցադրված չէ։
Անկյունաքարը լյարդի ցիրոզւ բուժման դա պատճառային գործոնի վերացումն է որը կբերի լյարդի ցիրոզի
պչոգրեսիայի կանխման և երբեմն կարելի է դիտարկել նաև լյարդի ֆիբրոզի ռեգրես եթե հայտնաբերվում է
համապատասխան հիվանդությունը և այն վերացվում է ։ Եվ իհարկե վերջնական բուժումը դա լյարդի
փողպատվաստումն է"""
print(get_translation(text,'ru-RU'))